app/views/links/index.html.erb


    <p class='details'>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<%= link.upvotes %> upvotes | <%= link_to "#{link.comments.length} comments", link_path(link) %> | Created <%=link.age%> ago  | <%= link_to "Add a comment", new_link_comment_path(link), :class => "btn btn-default btn-sm" %> | <%= link_to "delete", link_path(link), :method => 'delete' %> </p>
---
SELECT "comments".* FROM "comments" WHERE "comments"."link_id" = $1  [["link_id", 1]]