app/views/links/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."link_id" = $1  [["link_id", 1]]
---
<ul>
 <% @link.comments.each do |comment| %>