app/controllers/comments_controller.rb

SELECT  "links".* FROM "links" WHERE "links"."id" = $1  ORDER BY upvotes DESC LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 4]]
---
  def new
    if params[:comment_id] == nil #to determine where comments are being added--link (in which case no comment.id in url) or comment
      @link = Link.find(params[:link_id])
       @object_of_comment = Link.find(params[:link_id])
    else
       @object_of_comment = Comment.find(params[:comment_id])

SELECT  "links".* FROM "links" WHERE "links"."id" = $1  ORDER BY upvotes DESC LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("comment", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "This is a brand new comment. Cool."], ["commentable_id", 2], ["commentable_type", "Link"], ["created_at", "2015-02-03 19:51:08.623468"], ["updated_at", "2015-02-03 19:51:08.623468"]]
---
  def create
    if params[:comment_id] == nil
       @object_of_comment = Link.find(params[:link_id])
    else
       @object_of_comment = Comment.find(params[:comment_id])
    end
    @comment = @object_of_comment.comments.new(comment_params)
    @link = @comment.find_original_link
    if @comment.save

SELECT  "links".* FROM "links" WHERE "links"."id" = $1  ORDER BY upvotes DESC LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
     @link = Link.find(params[:link_id])
    @comment = Comment.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "comments" SET "comment" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["comment", "This is a site that is just ok. Actually, now it is edited!"], ["updated_at", "2015-02-03 16:48:03.497153"], ["id", 1]]
---
  def update
    @comment = Comment.find(params[:id])
    @comment.update(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 11]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 11]]
SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", 2]]
---
 def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
     flash[:notice] = "comment Deleted"
    @link = @comment.find_original_link