app/controllers/links_controller.rb

SELECT "links".* FROM "links"  ORDER BY upvotes DESC
---
  def index
    @links = Link.order_by_rating_formula

INSERT INTO "links" ("name", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "New York Times"], ["url", "www.nytimes.com"], ["created_at", "2015-02-02 15:49:35.339952"], ["updated_at", "2015-02-02 15:49:35.339952"]]
---
  def create
    @link = Link.new(link_params)
    if @link.save

SELECT  "links".* FROM "links" WHERE "links"."id" = $1  ORDER BY upvotes DESC LIMIT 1  [["id", 1]]
---
  def show
    @link = Link.find(params[:id])

SELECT  "links".* FROM "links" WHERE "links"."id" = $1  ORDER BY upvotes DESC LIMIT 1  [["id", 2]]
UPDATE "links" SET "upvotes" = $1, "url" = $2, "updated_at" = $3 WHERE "links"."id" = $4  [["upvotes", 12], ["url", "http://www.cnn.com"], ["updated_at", "2015-02-04 16:34:59.486966"], ["id", 2]]
---
  def update
    @link = Link.find(params[:id])
    @link.update(link_params)

SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "links" WHERE "links"."id" = $1  [["id", 1]]
---
 def destroy
    @link = Link.find(params[:id])
    @link.destroy